Задача 47: Задайте двумерный массив размером m×n, заполненный случайными вещественными числами.

Задача 50: Напишите программу, которая на вход принимает позиции элемента в двумерном массиве, и возвращает значение этого элемента или же указание, что такого элемента нет.

Задача 52: Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.

Задача со звездочкой: Написать программу для перевода римских чисел в десятичные арабские.
III -> 3
LVIII -> 58
MCMXCIV -> 1994

I — 1
V — 5
X — 10
L — 50
C — 100
D — 500
M — 1000

Ноль отсутствует вообще, поэтому будем использовать пустое значение.

Калькулятор

Перевод любых чисел от 1 до 3999 в римские числа и определение века для указанного года.
Года римскими цифрами. Таблица

Таблица соответствия годов в арабской и римской записи в диапазоне от 1890 до 2020 года.
Века римскими цифрами

Таблица соответствия года и века римскими цифрами в диапазоне от 1 до 2100 года.
Перевод арабских чисел в римские

В римском исчислении используют всего семь заглавных букв латинского алфавита.

    I - 1
    V - 5
    X - 10
    L - 50
    C - 100
    D - 500
    M - 1000

Натуральные числа записываются при помощи повторения этих цифр.

При этом, если большая цифра стоит перед меньшей, то они складываются (принцип сложения), если же меньшая стоит перед большей, то меньшая вычитается из большей (принцип вычитания).

Последнее правило применяется только для исключения четырёхкратного повторения одной и той же цифры.

Некоторые из цифр (I, X, C, M - единицы в соответствующих разрядах) могут повторяться, но не более трёх раз подряд.

Принцип вычитания применяется только к шести числам:

    IV - 4
    IX - 9
    XL - 40
    XC - 90
    CD - 400
    CM - 900

С помощью римских цифр можно записать любое целое число, но не более 3999 (MMMCMXCIX).

В качестве примера это число и рассмотрим. Выделяем разряды - MMM'CM'XC'IX:

    MMM - Три подряд символа 1000, т.е. это запись числа 3000
    CM - Единица в разряде сотен стоит перед десятью в разряде сотен, т.е. применяется принцип вычитания. Это запись числа 900
    XC - Единица в разряде десятков стоит перед десятью в разряде десятков, т.е. применяется принцип вычитания. Это запись числа 90
    IX - Единица стоит перед десятью, т.е. применяется принцип вычитания. Это запись числа 9

В сумме получается 3000 + 900 + 90 + 9 = 3999. 



    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
     
    namespace rim
    {
        class Program
        {
            static void Main(string[] args)
            {
                Console.WriteLine("Введите римскую цифру в эквиваленте от 1 до 3999,\nиспользуя символы 'I','V','X','L','C','D','M':");
                Console.WriteLine();
                while (true)
                {
                    string rim = Console.ReadLine();
                    int summa = 0;
     
                    for (int i = 0; i < rim.Length; i++)
                    {
                        if (i < rim.Length - 1 && rim[i] == 'I' && rim[i + 1] != 'I') continue;
                        else if (rim[i] == 'I')
                            summa += 1;
                        else if (rim[i] == 'V')
                        {
                            if (i > 0 && rim[i - 1] == 'I') summa += 4;
                            else summa += 5;
                        }
     
                        else if (rim[i] == 'X')
                        {
                            if (i > 0 && rim[i - 1] == 'I') summa += 9;
                            else if (i < rim.Length - 1 && (rim[i + 1] == 'L' || rim[i + 1] == 'C')) continue;
                            else summa += 10;
                        }
     
                        else if (rim[i] == 'L')
                        {
                            if (i > 0 && rim[i - 1] == 'X') summa += 40;
                            else summa += 50;
                        }
     
                        else if (rim[i] == 'C')
                        {
                            if (i > 0 && rim[i - 1] == 'X') summa += 90;
                            else if (i < rim.Length - 1 && (rim[i + 1] == 'D' || rim[i + 1] == 'M')) continue;
                            else summa += 100;
                        }
                        else if (rim[i] == 'D')
                        {
                            if (i > 0 && rim[i - 1] == 'C') summa += 400;
                            else summa += 500;
                        }
     
                        else if (rim[i] == 'M')
                        {
                            if (i > 0 && rim[i - 1] == 'C') summa += 900;
                            else summa += 1000;
                        }
     
                    }
                    Console.WriteLine(summa);
                    Console.WriteLine("*****");
                }
            }
        }
    }